// Задача 10: Напишите программу, которая принимает на вход трёхзначное 
//число и на выходе показывает вторую цифру этого числа. Через строку решать нельзя.

// 456 -> 5
// 782 -> 8
// 918 -> 1


//  Console.WriteLine("Введите число");
//  int x = Convert.ToInt32 (Console.ReadLine());

//  int x1 = x / 100;
//  int x2 = (x % 100) / 10;
//  int x3 = x % 10; 


//  Console.WriteLine($"{x2}");


// Задача 13: Напишите программу, которая выводит третью цифру заданного числа
//  или сообщает, что третьей цифры нет.Через строку решать нельзя.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

//   Console.WriteLine("Введите число");
//   int x = Convert.ToInt32 (Console.ReadLine());
  
//   if (x > 99)
//   {   
//     if (x > 999)
//     {    
//         if (x > 9999)
//         {
//         int x5 = (x / 100) % 10;
//         Console.WriteLine(x5);
//         }
//         else
//         {
//         int x4 = (x / 10) % 10;
//         Console.WriteLine(x4);  
//         }
//     }
//     else
//     {
//         int x3 = x % 10;
//         Console.WriteLine(x3);
//     }
//   }
//   else 
//     Console.WriteLine("Третьей цифры нет");   
 
   

// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Введите число");
// int x = Convert.ToInt32 (Console.ReadLine());

// if  (x < 6)
// {
//     Console.WriteLine("Нет");
// }
 // if (x == 6)      
// {
//     Console.WriteLine("Да");
// }      
// if (x == 7)
// {
//     Console.WriteLine("Да");
// }
// if (x > 7)
// {
//     Console.WriteLine("Неверное число");
// }   
   

